WcfHarness/WcfHarness/RequestXmls/GetDirectories_ById.xml

<?xml version="1.0" encoding="utf-8" ?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <GetDirectories xmlns="http://www.tavisca.com/Vexiere/IDirectory/2013/01">
      <getDirectoriesRequest xmlns:a="http://schemas.datacontract.org/2004/07/Tavisca.Vexiere.DataContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:AdditionalData i:nil="true"/>
        <a:FilterParameters>
          <a:FilterParameter>
            <a:SearchOn>Id</a:SearchOn>
            <a:SearchOperator>EqualTo</a:SearchOperator>
            <a:SearchValue i:type="a:NumericValue">
              <a:Value>12</a:Value>
            </a:SearchValue>
          </a:FilterParameter>
        </a:FilterParameters>
        <a:PagingInfo i:nil="true"/>
        <a:SearchScope i:nil="true"/>
        <a:SortingInfo i:nil="true"/>
      </getDirectoriesRequest>
    </GetDirectories>
  </s:Body>
</s:Envelope>